Examinator/src/InformationRegisters/ВозможностиУчитьсяСУО/ВозможностиУчитьсяСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВозможностиУчитьсяСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>МожетУчиться</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Загружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Бессрочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВозможностиУчитьсяСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ВсеЗаписиЗаПериод(Пользователь, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозможностиУчитьсяСУО.Период КАК Период,
		|	ВозможностиУчитьсяСУО.Пользователь,
		|	ВозможностиУчитьсяСУО.МожетУчиться,
		|	ВозможностиУчитьсяСУО.ИдентификаторСтроки,
		|	ВозможностиУчитьсяСУО.Описание,
		|	ВозможностиУчитьсяСУО.Загружено,
		|	ВозможностиУчитьсяСУО.ДатаИзменения,
		|	ВозможностиУчитьсяСУО.Ответственный,
		|	ВозможностиУчитьсяСУО.Бессрочно,
		|	ВозможностиУчитьсяСУО.ДатаЗагрузки КАК ДатаЗагрузки
		|ИЗ
		|	РегистрСведений.ВозможностиУчитьсяСУО КАК ВозможностиУчитьсяСУО
		|ГДЕ
		|	ВозможностиУчитьсяСУО.Пользователь = &Пользователь
		|	И ВозможностиУчитьсяСУО.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозможностиУчитьсяСУО.Бессрочно = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозможностиУчитьсяСУО.Период,
		|	ВозможностиУчитьсяСУО.Пользователь,
		|	ВозможностиУчитьсяСУО.МожетУчиться,
		|	ВозможностиУчитьсяСУО.ИдентификаторСтроки,
		|	ВозможностиУчитьсяСУО.Описание,
		|	ВозможностиУчитьсяСУО.Загружено,
		|	ВозможностиУчитьсяСУО.ДатаИзменения,
		|	ВозможностиУчитьсяСУО.Ответственный,
		|	ВозможностиУчитьсяСУО.Бессрочно,
		|	ВозможностиУчитьсяСУО.ДатаЗагрузки
		|ИЗ
		|	РегистрСведений.ВозможностиУчитьсяСУО КАК ВозможностиУчитьсяСУО
		|ГДЕ
		|	ВозможностиУчитьсяСУО.Бессрочно = ИСТИНА
		|	И ВозможностиУчитьсяСУО.Пользователь = &Пользователь
		|	И ВозможностиУчитьсяСУО.Период <= &КонецПериода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВсеРучныеЗаписи(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозможностиУчитьсяСУО.Период,
		|	ВозможностиУчитьсяСУО.Пользователь,
		|	ВозможностиУчитьсяСУО.Бессрочно,
		|	ВозможностиУчитьсяСУО.МожетУчиться,
		|	ВозможностиУчитьсяСУО.ИдентификаторСтроки,
		|	ВозможностиУчитьсяСУО.Ответственный,
		|	ВозможностиУчитьсяСУО.ДатаИзменения,
		|	ВозможностиУчитьсяСУО.Описание
		|ИЗ
		|	РегистрСведений.ВозможностиУчитьсяСУО КАК ВозможностиУчитьсяСУО
		|ГДЕ
		|	ВозможностиУчитьсяСУО.Пользователь = &Пользователь
		|	И ВозможностиУчитьсяСУО.ИдентификаторСтроки <> &ПустойИдентификатор";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДатаПоследнейЗагрузки(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВозможностиУчитьсяСУО.ДатаЗагрузки КАК ДатаЗагрузки
		|ИЗ
		|	РегистрСведений.ВозможностиУчитьсяСУО КАК ВозможностиУчитьсяСУО
		|ГДЕ
		|	ВозможностиУчитьсяСУО.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗагрузки УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ДатаЗагрузки;
	
КонецФункции

Процедура УстановитьРучноеЗначение(Пользователь, Период, Бессрочно, МожетУчиться, ИдентификаторСтроки, Ответственный, ДатаИзменения, Описание) Экспорт
	
	НаборЗаписей = РегистрыСведений.ВозможностиУчитьсяСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Бессрочно.Установить(Бессрочно);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// Добавляем ручную запись
		Запись = НаборЗаписей.Добавить();
		Запись.Период = Период;
		Запись.Пользователь = Пользователь;		
		Запись.Бессрочно = Бессрочно;
		Запись.Загружено = Ложь;		
	Иначе
		// Заменяем загруженную запись
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.МожетУчиться = МожетУчиться;
	Запись.ИдентификаторСтроки = ИдентификаторСтроки;
	Запись.Ответственный = Ответственный;
	Запись.ДатаИзменения = ДатаИзменения;
	Запись.Описание = Описание;
	
	Если НЕ Запись.Загружено И НЕ ЗначениеЗаполнено(Запись.ИдентификаторСтроки) Тогда
		ВызватьИсключение НСтр("ru = 'Найдена запись о возможности учиться, не загруженная и не добавленная вручную'");
	КонецЕсли;
	
	НаборЗаписей.Записать();		
	
КонецПроцедуры

Процедура УдалитьРучноеЗначение(Пользователь, Период, Бессрочно) Экспорт
	
	НаборЗаписей = РегистрыСведений.ВозможностиУчитьсяСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Бессрочно.Установить(Бессрочно);	
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат; // Нечего удалять
	КонецЕсли;
	
	Если НаборЗаписей[0].Загружено Тогда
		// Очищаем загруженную запись
		НаборЗаписей[0].МожетУчиться = Ложь;
		НаборЗаписей[0].ИдентификаторСтроки = Неопределено;
		НаборЗаписей[0].Ответственный = Неопределено;
		НаборЗаписей[0].ДатаИзменения = Неопределено;
		НаборЗаписей[0].Описание = Неопределено;					
	Иначе	
		// Удаляем ручную запись
		НаборЗаписей.Очистить();		
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьЗагруженноеЗначение(Пользователь, Период, Бессрочно, МожетУчиться) Экспорт
	
	НаборЗаписей = РегистрыСведений.ВозможностиУчитьсяСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);	
	НаборЗаписей.Отбор.Бессрочно.Установить(Бессрочно);	

	НаборЗаписей.Прочитать();
	
	// Если можем учиться, то запись об этом не нужна,
	// но если есть ручная запись, то ее надо обновить,
	// и сбросив информацию о том, что запись загружена.
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Если НЕ МожетУчиться Тогда
			// Добавляем загруженную запись, если не может учиться
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = Период;
			НоваяЗапись.Пользователь = Пользователь;
			НоваяЗапись.Бессрочно = Бессрочно;				
			НоваяЗапись.МожетУчиться = Ложь;		
			НоваяЗапись.Загружено = Истина;
			НоваяЗапись.ДатаЗагрузки = ТекущаяДата();
		КонецЕсли;
	Иначе
		НоваяЗапись = НаборЗаписей[0];
		Если НЕ НоваяЗапись.Загружено И НЕ ЗначениеЗаполнено(НоваяЗапись.ИдентификаторСтроки) Тогда
			ВызватьИсключение НСтр("ru = 'Найдена запись возможности учиться, не загруженная и не добавленная вручную'");
		КонецЕсли;		
		Если ЗначениеЗаполнено(НоваяЗапись.ИдентификаторСтроки) Тогда
			// Это запись с ручным значением
			Если МожетУчиться Тогда
				// Сбрасываем информацию о том, что запись загружена
				НоваяЗапись.Загружено = Ложь;
				НоваяЗапись.ДатаЗагрузки = Неопределено;				
			Иначе
				// Делаем запись загруженной
				НоваяЗапись.Загружено = Истина;
				НоваяЗапись.ДатаЗагрузки = ТекущаяДата();								
			КонецЕсли;
		Иначе
			Если МожетУчиться Тогда
				// Удаляем загруженную запись
				НаборЗаписей.Очистить();
			Иначе
				// Обновляем загруженную запись
				НоваяЗапись.ДатаЗагрузки = ТекущаяДата();				
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
